ePishi/epishi_LPSTK-CC1352R/dmm_154sensor_remote_display_oad_lpstk_app_CC1352R1_LAUNCHXL_tirtos_ccs/dmm_154sensor_remote_display_oad_lpstk.syscfg
dmm.policy2.blePeripheral.$name = "ti_dmm_policy_stack_dmm_stack_ble2";
// Name
dmm.policy2.ti154Sensor.$name = "ti_dmm_policy_stack_dmm_stack_ti154stack2";
// Weight - Stack priority for this policy
dmm.policy2.ti154Sensor.weight = 1;
// Suggest solution
UART1.uart.$suggestSolution = "UART1";
// Suggest solution
UART1.uart.txPin.$suggestSolution = "19";
// Suggest solution
UART1.uart.rxPin.$suggestSolution = "18";
// Suggest solution
Button1.gpioPin.gpioPin.$suggestSolution = "21";
// Suggest solution
Button2.gpioPin.gpioPin.$suggestSolution = "20";
// Suggest solution
LED1.gpioPin.gpioPin.$suggestSolution = "11";
// Suggest solution
LED2.gpioPin.gpioPin.$suggestSolution = "12";
// Suggest solution
GPIO6.gpioPin.$suggestSolution = "40";
// Suggest solution
GPIO7.gpioPin.$suggestSolution = "42";
// Suggest solution
GPIO8.gpioPin.$suggestSolution = "38";
// Suggest solution
GPIO9.gpioPin.$suggestSolution = "37";
// Suggest solution
GPIO10.gpioPin.$suggestSolution = "39";
// Suggest solution
NVSSPI25XDevice1.slaveSelectGpioInstance.gpioPin.$suggestSolution = "30";
// Suggest solution
SPI1.spi.$suggestSolution = "SSI0";
// Suggest solution
SPI1.spi.sclkPin.$suggestSolution = "16";
// Suggest solution
SPI1.spi.misoPin.$suggestSolution = "14";
// Suggest solution
SPI1.spi.mosiPin.$suggestSolution = "15";
// Suggest solution
SPI1.spi.dmaRxChannel.$suggestSolution = "DMA_CH3";
// Suggest solution
SPI1.spi.dmaTxChannel.$suggestSolution = "DMA_CH4";
// Suggest solution
I2C1.i2c.$suggestSolution = "I2C0";
// Suggest solution
I2C1.i2c.sdaPin.$suggestSolution = "10";
// Suggest solution
I2C1.i2c.sclPin.$suggestSolution = "9";
// Suggest solution
ADC1.adc.$suggestSolution = "ADC0";
// Suggest solution
ADC1.adc.adcPin.$suggestSolution = "36";
